[
    {
        "id": 1,
        "images":"https://i.ibb.co/dr3Cx95/Rectangle-2-2.png",
        "course_name": "Introduction to C Programming",
        "credit": 1,
        "price": 15000,
        "description":"C is a general-purpose, procedural, high-level programming language that was developed in 1972 by Dennis M. Ritchie at Bell Labs. It is one of the most popular and widely used programming languages in the world."
    },
    {
        "id": 2,
        "images":"https://i.ibb.co/1bqJt2L/Rectangle-2-3.png",
        "course_name": "Introduction to Algorithms",
        "credit": 2,
        "price": 25000,
        "description": "An algorithm is a step-by-step procedure for solving a problem. Algorithms are used in all areas of computer science, from sorting and searching to machine learning and artificial intelligence."
    },
    {
        "id": 3,
        "images":"https://i.ibb.co/vkZxfL6/Rectangle-2-4.png",
        "course_name": "Introduction to C++ for DSA",
        "credit": 10,
        "price": 1000,
        "description": "C++ is a general-purpose programming language that is widely used in software development, including data structures and algorithms (DSA). C++ is an object-oriented language."
    },
    {
        "id": 4,
        "images":"https://i.ibb.co/VDJCQQb/Rectangle-3.png",
        "course_name": "Basic Data Structures",
        "credit": 5,
        "price": 35000,
        "description": "Basic data structures are the building blocks of more complex data structures and algorithms. They are used to organize and store data in a way that is efficient and easy to access."
    },
    {
        "id": 5,
        "images":"https://i.ibb.co/qDzZzP5/Rectangle-2.png",
        "course_name": "Introduction to OOP Python",
        "credit": 5,
        "price": 19000,
        "description": "Object-oriented programming (OOP) is a programming paradigm that uses objects and classes to design and build software. Objects are self-contained units of code that contain both data and behavior."
    },
    {
        "id": 6,
        "images":"https://i.ibb.co/7zwsJw3/Rectangle-2-5.png",
        "course_name": "Software Engineering",
        "credit": 2,
        "price": 23000,
        "description": "Software engineering is a systematic approach to the development, deployment, and maintenance of software systems. It is a complex and challenging field, but it is also very rewarding."
    },
    {
        "id": 7,
        "images":"https://i.ibb.co/t8rfR07/Rectangle-3-1.png",
        "course_name": "AWS, Cloud Computing",
        "credit": 5,
        "price": 35000,
        "description": "Amazon Web Services (AWS) is a cloud computing platform that offers a broad set of global compute, storage, database, analytics, application, and deployment services that help organizations move faster, lower IT costs."
    },
    {
        "id": 8,
        "images":"https://i.ibb.co/nMLzSKT/Rectangle-2-1.png",
        "course_name": "Database (MySQL)",
        "credit": 5,
        "price": 19000,
        "description": "MySQL is a relational database management system (RDBMS) that uses SQL (Structured Query Language) to manage data. It is one of the most popular RDBMSs in the world, and is used by millions of websites and applications."
    },
    {
        "id": 9,
        "images":"https://i.ibb.co/FwKJrcd/Rectangle-2-6.png",
        "course_name": "Problem-Solving Part",
        "credit":2,
        "price": 23000,
        "description": "Problem-solving is the process of finding solutions to problems. It is a skill that is essential for success in all areas of life, from personal relationships to professional careers."
    }
]